Reports/ОтчетПоЗадолженностиНаселенияФорма_16.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетПоЗадолженностиНаселенияФорма_16</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетПоЗадолженностиНаселенияФорма_16/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере1()
	Макет = Отчеты.ОтчетПоЗадолженностиНаселенияФорма_16.ПолучитьМакет("Макет");
	Результат.Очистить();
	// Получим количество абонентов
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	КвоАбонентов = Запрос.Выполнить().Выгрузить();  //ОбщееКвоАбонентов = КвоАбонентов.Количество();
	
	// Получим начисления по всем лицевым счетам
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	РасчетыПоЛицевымСчетам.Активность
	    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
		//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	СуммаНачислений = Запрос.Выполнить().Выгрузить(); // ОбщийИтог = СуммаНачислений[0].Сумма
	
	//Получим оплату за выбранный период
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	СуммаОплат = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплата = СуммаОплат[0].Сумма
	
	// Получим оплату по субсидиям
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |	И ДенежныеСредства.БанковскийСчетКасса = &БанковскийСчетКасса
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БанковскийСчетКасса", Справочники.БанковскиеСчета.НайтиПоНаименованию("Ощад субсидії"));
	СуммаОплатСубсидии = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплатаСубсидии = СуммаОплат[0].Сумма
	ЛССубсидии = СуммаОплатСубсидии.ВыгрузитьКолонку("ЛицевойСчет");  // КвоАбонентовСубсидии = ЛС.Количество();
	Если ЛССубсидии.Количество() <> 0 Тогда
	    ЛССубсидии.Удалить(0);
	КонецЕсли;
	// Получим начисления по субсидиям
	СуммаНачисленийСубсидии = 0;
	Для Каждого стр Из ЛССубсидии Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		    |	РасчетыПоЛицевымСчетам.Сумма КАК Сумма
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Активность
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
			|	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			//|{ГДЕ
			//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
			//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет";
		Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ЛицевойСчет", стр.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаНачисленийСубсидии = СуммаНачисленийСубсидии + Выборка.Сумма;
		КонецЦикла;	
	КонецЦикла;
	
	// Получим оплату по льготам
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |	И ДенежныеСредства.БанковскийСчетКасса = &БанковскийСчетКасса
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет	    
		|
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БанковскийСчетКасса", Справочники.БанковскиеСчета.НайтиПоНаименованию("Ощад пільги"));
	СуммаОплатЛьготы = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплатаЛьготы = СуммаОплат[0].Сумма
	ЛСЛьготы = СуммаОплатЛьготы.ВыгрузитьКолонку("ЛицевойСчет");  // КвоАбонентовЛьготы = ЛС.Количество();
	ЛСЛьготы.Удалить(0);
	// Получим начисления по льготам
	СуммаНачисленийЛьготы = 0;
	Для Каждого стр Из ЛСЛьготы Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		    |	РасчетыПоЛицевымСчетам.Сумма КАК Сумма
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Активность
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			//|{ГДЕ
			//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
			//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет";
		Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ЛицевойСчет", стр.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаНачисленийЛьготы = СуммаНачисленийЛьготы + Выборка.Сумма;
		КонецЦикла;	
	КонецЦикла;
	
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация = Отчет.Организация;
	ОбластьСтрока.Параметры.КвоАбонентов = КвоАбонентов.Количество() / 1000;
	ОбластьСтрока.Параметры.НачисленоВсего = СуммаНачислений[0].Сумма / 1000;
	ОбластьСтрока.Параметры.ОплаченоВсего = СуммаОплат[0].Сумма / 1000;
	ОбластьСтрока.Параметры.ПроценОплатыВсего = ((СуммаОплат[0].Сумма / СуммаНачислений[0].Сумма) * 100);
	ОбластьСтрока.Параметры.ЗадолженостьВсего = (СуммаНачислений[0].Сумма - СуммаОплат[0].Сумма) / 1000;
	ОбластьСтрока.Параметры.КвоАбонентовСубсидии = ЛССубсидии.Количество() / 1000;
	Если СуммаОплатСубсидии.Количество() <> 0 Тогда
	    ОбластьСтрока.Параметры.ОплаченоСубсидии = СуммаОплатСубсидии[0].Сумма / 1000;
		ОбластьСтрока.Параметры.НачисленоСубсидии = СуммаНачисленийСубсидии / 1000;
		ОбластьСтрока.Параметры.ПроценОплатыСубсидии = ((СуммаОплатСубсидии[0].Сумма / СуммаНачисленийСубсидии)*100);
		ОбластьСтрока.Параметры.ЗадолженостьСубсидии = (СуммаНачисленийСубсидии - СуммаОплатСубсидии[0].Сумма) / 1000;
	Иначе 
		ОбластьСтрока.Параметры.ОплаченоСубсидии = 0;
	КонецЕсли;
	
	ОбластьСтрока.Параметры.КвоАбонентовЛьготы = ЛСЛьготы.Количество() / 1000;
	ОбластьСтрока.Параметры.НачисленоЛьготы = СуммаНачисленийЛьготы / 1000;
	ОбластьСтрока.Параметры.ОплаченоЛьготы = СуммаОплатЛьготы[0].Сумма / 1000;
	ОбластьСтрока.Параметры.ПроценОплатыЛьготы = ((СуммаОплатЛьготы[0].Сумма / СуммаНачисленийЛьготы) * 100);
	ОбластьСтрока.Параметры.ЗадолженостьЛьготы = (СуммаНачисленийЛьготы - СуммаОплатЛьготы[0].Сумма) / 1000;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
КонецФункции

&НаСервере
Функция СформироватьНаСервере2()
	Макет = Отчеты.ОтчетПоЗадолженностиНаселенияФорма_16.ПолучитьМакет("Форма16_04_10_2022");
	Результат.Очистить();
	// Получим количество абонентов
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	КвоАбонентов = Запрос.Выполнить().Выгрузить();  //ОбщееКвоАбонентов = КвоАбонентов.Количество();
	
	// Получим начисления по всем лицевым счетам
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	РасчетыПоЛицевымСчетам.Активность
	    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
		//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	СуммаНачислений = Запрос.Выполнить().Выгрузить(); // ОбщийИтог = СуммаНачислений[0].Сумма
	
	//Получим оплату за выбранный период
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	СуммаОплат = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплата = СуммаОплат[0].Сумма
	
	// Получим оплату по субсидиям
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |	И ДенежныеСредства.БанковскийСчетКасса = &БанковскийСчетКасса
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БанковскийСчетКасса", Справочники.БанковскиеСчета.НайтиПоНаименованию("Ощад субсидії"));
	СуммаОплатСубсидии = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплатаСубсидии = СуммаОплат[0].Сумма
	ЛССубсидии = СуммаОплатСубсидии.ВыгрузитьКолонку("ЛицевойСчет");  // КвоАбонентовСубсидии = ЛС.Количество();
	Если ЛССубсидии.Количество() <> 0 Тогда
	    ЛССубсидии.Удалить(0);
	КонецЕсли;
	// Получим начисления по субсидиям
	СуммаНачисленийСубсидии = 0;
	Для Каждого стр Из ЛССубсидии Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		    |	РасчетыПоЛицевымСчетам.Сумма КАК Сумма
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Активность
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
			|	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			//|{ГДЕ
			//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
			//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет";
		Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ЛицевойСчет", стр.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаНачисленийСубсидии = СуммаНачисленийСубсидии + Выборка.Сумма;
		КонецЦикла;	
	КонецЦикла;
	
	// Получим оплату по льготам
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Активность = ИСТИНА
	    |	И ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |	И ДенежныеСредства.БанковскийСчетКасса = &БанковскийСчетКасса
		|	И ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|{ГДЕ
		//|	(ДенежныеСредства.Период >= &ДатаНачала
		//|			И ДенежныеСредства.Период <= &ДатаОкончания) КАК Поле2}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет	    
		|
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |ИТОГИ ПО
	    |	ОБЩИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БанковскийСчетКасса", Справочники.БанковскиеСчета.НайтиПоНаименованию("Ощад пільги"));
	СуммаОплатЛьготы = Запрос.Выполнить().Выгрузить(); // ОбщийИтогОплатаЛьготы = СуммаОплат[0].Сумма
	ЛСЛьготы = СуммаОплатЛьготы.ВыгрузитьКолонку("ЛицевойСчет");  // КвоАбонентовЛьготы = ЛС.Количество();
	Если ЛСЛьготы.Количество() <> 0 Тогда
		ЛСЛьготы.Удалить(0);
		// Получим начисления по льготам
		СуммаНачисленийЛьготы = 0;
		Для Каждого стр Из ЛСЛьготы Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
			    |	РасчетыПоЛицевымСчетам.Сумма КАК Сумма
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
			    |ГДЕ
			    |	РасчетыПоЛицевымСчетам.Активность
			    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
			    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				//|{ГДЕ
				//|	(РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
				//|			И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания) КАК Поле2}
			    |
			    |УПОРЯДОЧИТЬ ПО
			    |	ЛицевойСчет";
			Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
			Запрос.УстановитьПараметр("ЛицевойСчет", стр.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СуммаНачисленийЛьготы = СуммаНачисленийЛьготы + Выборка.Сумма;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
	_НачисленияАбонПлата = НачислениеАбонПлаты();
	
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация = Отчет.Организация;
	ОбластьСтрока.Параметры.ОКПП = Отчет.Организация.КодПоЕДРПОУ;
	ОбластьСтрока.Параметры.КвоАбонентов = КвоАбонентов.Количество() / 1000;
	ОбластьСтрока.Параметры.НачисленоВсего = СуммаНачислений[0].Сумма / 1000;
	ОбластьСтрока.Параметры.ОплаченоВсего = СуммаОплат[0].Сумма / 1000;
	//ОбластьСтрока.Параметры.АбонплатаНачислено = _НачисленияАбонПлата.Итог("Сумма") / 1000;
	ОбластьСтрока.Параметры.ЗадолженостьВсего = (СуммаНачислений[0].Сумма - СуммаОплат[0].Сумма) / 1000;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Макет = Отчеты.ОтчетПоЗадолженностиНаселенияФорма_16.ПолучитьМакет("Форма16_04_10_2022_Д16");
	тзМиргород.Очистить();
	тзБагачка.Очистить();
	спУслуг      = Новый СписокЗначений;
	спУслугХВ    = Новый СписокЗначений;
	спУслугСтоки = Новый СписокЗначений;
	спУслугАП    = Новый СписокЗначений;
	спУслугХВСтоки = Новый СписокЗначений;
	
	КодУслугиПФУ = Новый СписокЗначений;
	КодУслугиПФУ.Добавить("106");           // Стоки
	КодУслугиПФУ.Добавить("104.2");         // ХВ
	КодУслугиПФУ.Добавить("104.1");         // ХВ
	КодУслугиПФУ.Добавить("112");           // абон вода
	КодУслугиПФУ.Добавить("113");           // абон стоки
	
	ЗапросПоУслугам = Новый Запрос;
	ЗапросПоУслугам.Текст =
	    "ВЫБРАТЬ
	    |	Услуги.Ссылка
	    |ИЗ
	    |	Справочник.Услуги КАК Услуги
	    |ГДЕ
	    |	Услуги.ПометкаУдаления = ЛОЖЬ
	    |	И Услуги.КодУслугиПФУ В(&КодУслугиПФУ)";
	ЗапросПоУслугам.УстановитьПараметр("КодУслугиПФУ", КодУслугиПФУ);
	РезультатПоУслугам = ЗапросПоУслугам.Выполнить();
	Выборка = РезультатПоУслугам.Выбрать();
	Пока Выборка.Следующий() Цикл
		спУслуг.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	// Запит по послугах ХВ
	КодУслугиПФУХВ = Новый СписокЗначений;
	КодУслугиПФУХВ.Добавить("104.2");         // ХВ
	КодУслугиПФУХВ.Добавить("104.1");         // ХВ
	
	ЗапросПоУслугамХВ = Новый Запрос;
	ЗапросПоУслугамХВ.Текст =
	    "ВЫБРАТЬ
	    |	Услуги.Ссылка
	    |ИЗ
	    |	Справочник.Услуги КАК Услуги
	    |ГДЕ
	    |	Услуги.ПометкаУдаления = ЛОЖЬ
	    |	И Услуги.КодУслугиПФУ В(&КодУслугиПФУ)";
	ЗапросПоУслугамХВ.УстановитьПараметр("КодУслугиПФУ", КодУслугиПФУХВ);
	РезультатПоУслугам = ЗапросПоУслугамХВ.Выполнить();
	Выборка = РезультатПоУслугам.Выбрать();
	Пока Выборка.Следующий() Цикл
		спУслугХВ.Добавить(Выборка.Ссылка);
		спУслугХВСтоки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	// Запит по послугах Стоки
	КодУслугиПФУСтоки = Новый СписокЗначений;
	КодУслугиПФУСтоки.Добавить("106");         // Стоки
	
	ЗапросПоУслугамСтоки = Новый Запрос;
	ЗапросПоУслугамСтоки.Текст =
	    "ВЫБРАТЬ
	    |	Услуги.Ссылка
	    |ИЗ
	    |	Справочник.Услуги КАК Услуги
	    |ГДЕ
	    |	Услуги.ПометкаУдаления = ЛОЖЬ
	    |	И Услуги.КодУслугиПФУ В(&КодУслугиПФУ)";
	ЗапросПоУслугамСтоки.УстановитьПараметр("КодУслугиПФУ", КодУслугиПФУСтоки);
	РезультатПоУслугам = ЗапросПоУслугамСтоки.Выполнить();
	Выборка = РезультатПоУслугам.Выбрать();
	Пока Выборка.Следующий() Цикл
		спУслугСтоки.Добавить(Выборка.Ссылка);
		спУслугХВСтоки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	КодУслугиПФУАП = Новый СписокЗначений;
	КодУслугиПФУАП.Добавить("112");
	КодУслугиПФУАП.Добавить("113");
	
	ЗапросПоУслугамАП = Новый Запрос;
	ЗапросПоУслугамАП.Текст =
	    "ВЫБРАТЬ
	    |	Услуги.Ссылка
	    |ИЗ
	    |	Справочник.Услуги КАК Услуги
	    |ГДЕ
	    |	Услуги.ПометкаУдаления = ЛОЖЬ
	    |	И Услуги.КодУслугиПФУ В(&КодУслугиПФУ)";
	ЗапросПоУслугамАП.УстановитьПараметр("КодУслугиПФУ", КодУслугиПФУАП);
	РезультатПоУслугамАП = ЗапросПоУслугамАП.Выполнить();
	Выборка = РезультатПоУслугамАП.Выбрать();
	Пока Выборка.Следующий() Цикл
		спУслугАП.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	КодКОАТУУМиргород = "5310900000";
	КодКОАТУУБагачка  = "5320255100";
	Результат.Очистить();
	
	// Отримаємо к-ть абонентів Миргород
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслуг);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	//НовСтрокаМиргород = тзМиргород.Добавить();
	//НовСтрокаМиргород.КвоАбонентов = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовМиргород Цикл
		спАбонентовМиргород.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// Отримаємо к-ть абонентів по ХВ Миргород
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугХВ);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовХВ = КвоАбонентовМиргород.Количество() / 1000;
	
	// Отримаємо к-ть абонентів по стоках Миргород
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугСтоки);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.КвоАбонентовСтоки = КвоАбонентовМиргород.Количество() / 1000;
	
	// Отримаємо к-ть абонентів по Абонплаті Миргород
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугАП);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.КвоАбонентовАбонОслуж = КвоАбонентовМиргород.Количество() / 1000;
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Отримаємо к-ть абонентів Багачка
	
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслуг);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	спАбонентовБагачка = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовБагачка Цикл
		спАбонентовБагачка.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// Отримаємо к-ть абонентів по ХВ Багачка
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслугХВ);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка = тзБагачка.Добавить();
	НовСтрокаБагачка.КвоАбонентовХВ = КвоАбонентовБагачка.Количество() / 1000;
	
	// Отримаємо к-ть абонентів по стокам Багачка
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслугСтоки);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.КвоАбонентовСтоки = КвоАбонентовБагачка.Количество() / 1000;
	
	// Отримаємо к-ть абонентів по Абонплаті Багачка
	ЗапросЛСБагачка = Новый Запрос;
	ЗапросЛСБагачка.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСБагачка.УстановитьПараметр("КодКОАТУУ", КодКОАТУУБагачка);
	ЗапросЛСБагачка.УстановитьПараметр("Услуга", спУслугАП);
	ЗапросЛСБагачка.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСБагачка.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовБагачка = ЗапросЛСБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.КвоАбонентовАбонОслуж = КвоАбонентовБагачка.Количество() / 1000;

	
	// Оплати по абонентам Миргород за останні 3 місяці
	тзДолжники = Новый ТаблицаЗначений;
	тзДолжники.Колонки.Добавить("ЛицевойСчет");
	тзДолжники.Колонки.Добавить("Долг");
	ЗапросДолг3Месяца = Новый Запрос;
	ЗапросДолг3Месяца.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3Месяца.УстановитьПараметр("ЛицевойСчет",   спАбонентовМиргород);
	ЗапросДолг3Месяца.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3Месяца.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3Месяца.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжники.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжники.Количество() / 1000;
	
	// Оплати по абонентам Багачка за останні 3 місяці
	тзДолжникиБагачка = Новый ТаблицаЗначений; 
	тзДолжникиБагачка.Колонки.Добавить("ЛицевойСчет");
	тзДолжникиБагачка.Колонки.Добавить("Долг");
	ЗапросДолг3МесяцаБагачка = Новый Запрос;
	ЗапросДолг3МесяцаБагачка.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3МесяцаБагачка.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3МесяцаБагачка.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжникиБагачка.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжникиБагачка.Количество() / 1000;
		
	// Виберемо заборгованість по особовим рахункам за вказаний період по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатДолгМиргород = ЗапросДолги.Выполнить().Выгрузить();
	НовСтрокаМиргород.ДолгТЕиГВНаНачалоПериода = РезультатДолгМиргород.Итог("СуммаОстаток") / 1000;
	
	// Виберемо заборгованість по особовим рахункам за вказаний період по Багачка
	ЗапросДолгиБагачка = Новый Запрос;
	ЗапросДолгиБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолгиБагачка.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолгиБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолгиБагачка.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатДолгБагачка = ЗапросДолгиБагачка.Выполнить().Выгрузить(); 
	НовСтрокаБагачка.ДолгТЕиГВНаНачалоПериода = РезультатДолгБагачка.Итог("СуммаОстаток") / 1000;
	
		
	// Виберемо нарахування за звітній період по Миргороду
	ЗапросНачисленияМиргород = Новый Запрос;
	ЗапросНачисленияМиргород.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга";
	ЗапросНачисленияМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияМиргород.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатНачисления = ЗапросНачисленияМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоТЕиГВЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо нарахування за звітній період по Багачка
	ЗапросНачисленияБагачка = Новый Запрос;
	ЗапросНачисленияБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросНачисленияБагачка.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатНачисления = ЗапросНачисленияБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.НачисленоТЕиГВЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати за звітній період по Миргороду
	ЗапросОплатиМиргород = Новый Запрос;
	ЗапросОплатиМиргород.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатиМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатиМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатиМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатиМиргород.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатНачисления = ЗапросОплатиМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоТЕиГВЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Виберемо оплати за звітній період по Багачка
	ЗапросОплатыБагачка = Новый Запрос;
	ЗапросОплатыБагачка.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатыБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатыБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатыБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросОплатыБагачка.УстановитьПараметр("Услуга", спУслугХВСтоки);
	РезультатНачисления = ЗапросОплатыБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.ОплаченоТЕиГВЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Залишок боргу на кінець звітного періоду
	НовСтрокаМиргород.ДолгЗаТЕиГВНаКонецПериод = НовСтрокаМиргород.ДолгТЕиГВНаНачалоПериода - НовСтрокаМиргород.ОплаченоТЕиГВЗаПериод + НовстрокаМиргород.НачисленоТЕиГВЗаПериод;
	НовСтрокаБагачка.ДолгЗаТЕиГВНаКонецПериод  = НовСтрокаБагачка.ДолгТЕиГВНаНачалоПериода - НовСтрокаБагачка.ОплаченоТЕиГВЗаПериод + НовСтрокаБагачка.НачисленоТЕиГВЗаПериод;
	
	// Виберемо заборгованість по Абоненському обслуговуванню на початок звітнього періоду по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугАП);
	НовСтрокаМиргород.ДолгАПНаНачалоПериода = ЗапросДолги.Выполнить().Выгрузить().Итог("СуммаОстаток") / 1000;
	
	// Виберемо заборгованість по Абоненському обслуговуванню на початок звітнього періоду по Багачка
	ЗапросДолгиБагачка = Новый Запрос;
	ЗапросДолгиБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолгиБагачка.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолгиБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросДолгиБагачка.УстановитьПараметр("Услуга", спУслугАП);
	НовСтрокаМиргород.ДолгАПНаНачалоПериода = ЗапросДолгиБагачка.Выполнить().Выгрузить().Итог("СуммаОстаток") / 1000;
	
	// Виберемо нарахування по АП за звітній період по Миргороду
	ЗапросНачисленияАП = Новый Запрос;
	ЗапросНачисленияАП.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияАП.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияАП.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияАП.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияАП.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросНачисленияАП.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоАПЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо нарахування по АП за звітній період по Багачка
	ЗапросНачисленияАПБагачка = Новый Запрос;
	ЗапросНачисленияАПБагачка.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
	ЗапросНачисленияАПБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияАПБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияАПБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросНачисленияАПБагачка.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросНачисленияАПБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.НачисленоАПЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати по АП за звітній період по Миргород
	ЗапросОплатаАП = Новый Запрос;
	ЗапросОплатаАП.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатаАП.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатаАП.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатаАП.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатаАП.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросОплатаАП.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоАПЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Виберемо оплати по АП за звітній період по Багачка
	ЗапросОплатаАПБагачка = Новый Запрос;
	ЗапросОплатаАПБагачка.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатаАПБагачка.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатаАПБагачка.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатаАПБагачка.УстановитьПараметр("ЛицевойСчет", спАбонентовБагачка);
	ЗапросОплатаАПБагачка.УстановитьПараметр("Услуга", спУслугАП);
	РезультатНачисления = ЗапросОплатаАПБагачка.Выполнить().Выгрузить();
	НовСтрокаБагачка.ОплаченоАПЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Борг по АП на кінець звітного періоду
	НовСтрокаМиргород.ДолгАПНаКонецПериода = НовСтрокаМиргород.ДолгАПНаНачалоПериода - НовСтрокаМиргород.ОплаченоАПЗаПериод;
	НовСтрокаБагачка.ДолгАПНаКонецПериода = НовСтрокаБагачка.ДолгАПНаНачалоПериода - НовСтрокаБагачка.ОплаченоАПЗаПериод;
	
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "Миргород";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовВода                  = тзМиргород[0].КвоАбонентовХВ;
	ОбластьСтрока.Параметры.КвоАбонентовСтоки                 = тзМиргород[0].КвоАбонентовСтоки;
	ОбластьСтрока.Параметры.КвоАбонентовАбонОслуж             = тзМиргород[0].КвоАбонентовАбонОслуж;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзМиргород[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзМиргород[0].ДолгТЕиГВНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоТЕиГВЗаПериод            = тзМиргород[0].НачисленоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоТЕиГВЗаПериод             = тзМиргород[0].ОплаченоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаТЕиГВНаКонецПериод          = тзМиргород[0].ДолгЗаТЕиГВНаКонецПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженностьНаНачало    = тзМиргород[0].ДолгАПНаНачалоПериода;
	ОбластьСтрока.Параметры.АбонплатаНачислено                = тзМиргород[0].НачисленоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонПлатаОплачено                 = тзМиргород[0].ОплаченоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженостьКонец        = тзМиргород[0].ДолгАПНаКонецПериода;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 2;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "смт.Велика Багачка";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовВода                  = тзБагачка[0].КвоАбонентовХВ;
	ОбластьСтрока.Параметры.КвоАбонентовСтоки                 = тзБагачка[0].КвоАбонентовСтоки;
	ОбластьСтрока.Параметры.КвоАбонентовАбонОслуж             = тзБагачка[0].КвоАбонентовАбонОслуж;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзБагачка[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзБагачка[0].ДолгТЕиГВНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоТЕиГВЗаПериод            = тзБагачка[0].НачисленоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоТЕиГВЗаПериод             = тзБагачка[0].ОплаченоТЕиГВЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаТЕиГВНаКонецПериод          = тзБагачка[0].ДолгЗаТЕиГВНаКонецПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженностьНаНачало    = тзБагачка[0].ДолгАПНаНачалоПериода;
	ОбластьСтрока.Параметры.АбонплатаНачислено                = тзБагачка[0].НачисленоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонПлатаОплачено                 = тзБагачка[0].ОплаченоАПЗаПериод;
	ОбластьСтрока.Параметры.АбонплатаЗадолженостьКонец        = тзБагачка[0].ДолгАПНаКонецПериода;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаСервере
Функция НачислениеАбонПлаты()
	спУслуга = Новый СписокЗначений;
	спУслуга.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000183"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетам.Сумма
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |	И РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
	    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
	Запрос.УстановитьПараметр("Услуга", спУслуга);
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции
